Repository: bluesky375/unibuzz-ios
Catalog: Strings/*.lproj/Localizable.strings
Languages: ar

source: Notifications
ar: الإشعارات

source: Math
ar: الرياضيات

source: Chemistry
ar: الكيمياء

source: Physics
ar: الفيزياء

source: Solution List
ar: قائمة الحلول

source: Search
ar: بحث

source: Sub categories
ar: التصنيفات الفرعية

source: Description
ar: الوصف

source: free-stuff
ar: أشياء مجانية

source: Confirm
ar: تأكيد

source: Are you sure you want to remove it?
ar: هل انت متأكد من الحذف؟

source: Yes
ar: نعم

source: No
ar: لا

source: Error
ar: خطأ

source: no internet
ar: لا يوجد إتصال بالإنترنت

source: Classified List
ar: قائمة الإعلانات

source: AED
ar: درهم

source: Note Detail
ar: تفاصيل الملخص

source: Loading
ar: يرجى الإنتظار

source: Chat
ar: محادثة

source: Classified Save List
ar: قائمة الإعلانات المحفوظة

source: Delete
ar: حذف

source: Are you sure to want to delete this?
ar: هل انت متأكد من الحذف؟

source: There are currently no Classfied.
ar: لا يوجد أي إعلانات حاليا

source: Motors
ar: سيارات

source: Edit
ar: تعديل

source: Classified categories
ar: تصنيفات الإعلانات المبوبة

source: Select
ar: تحديد

source: Group List
ar: قائمة المجموعات

source: All
ar: الكل

source: Local
ar: محلي

source: Not Specified
ar: غير محدد

source: Posted on :
ar: نُشِر في

source: Job Application
ar: إستمارة التقديم

source: Open
ar: التقديم مفتوح

source: Closed
ar: التقديم مغلق

source: Pending
ar: قيد الإنتظار

source: Shortlisted
ar: في قائمة المرشحين

source: Rejected
ar: مرفوض

source: Interviewing
ar: قيد إجراء المقابلة

source: Accepted
ar: مقبول

source: Already Applied
ar: تم التقديم سابقاً

source: Apply Now
ar: تقديم للوظيفة

source: You need to add your cv for applying jobs
ar: يجب إضافة سيرة ذاتية قبل التقديم للوظيفة

source: Create
ar: إنشاء

source: Cancel
ar: إلغاء

source: JOB DETAILS
ar: تفاصيل الوظيفة

source: REQUIREMENTS
ar: المتطلبات

source: SKILLS
ar: المهارات

source: OTHER BENEFITS
ar: محفزات وفوائد أُخرى

source: Cover Letter must not be less than 10 characters
ar: يجب كتابة 10 حروف على الأقل في رسالة طلب العمل

source: Cover Letter must not be greater than 13 characters
ar: رسالة طل العمل لا يجب أن تكون اكثر من 13 حرف

source: Free Book List
ar: قائمة الكتب المجانية

source: Book List
ar: قائمة الكتب

source: Book Add
ar: إضافة كتاب

source: Select Course
ar: إختر المساق

source: Enter the Title Name
ar: أدخل العنوان

source: Course Title must not be less than 5 characters
ar: عنوان المساق يجب أن يكون 5 حروف على الأقل

source: Course Title Not greater than 150
ar: عنوان المساق يجب أن لا يكون أكثر من 150 حروف

source: Enter the Price
ar: أدخل السعر

source: Price must not be greater than 1000
ar: السعر لا يجب أن يكون اكثر من 1000

source: Delete course
ar: حذف المساق

source: Book Sold
ar: تم بيع الكتاب

source: Enter Message
ar: أكتب رسالة

source: Used
ar: مستعمل

source: Message must be greater than 1 character
ar: يجب كتابة حرف على الأقل

source: Course Code
ar: رمز المساق

source: Enter the ISBN Number
ar: ISBN أدخل رمز

source: Reports
ar: تقارير

source: Slides
ar: عرض تقديمي

source: Notes
ar: ملخصات

source: Quiz
ar: إختبار

source: Document
ar: ملف

source: Select Pdf
ar: PDF إختر

source: Page
ar: صفحة

source: There are currently no Course in your List.
ar: لا يوجد مساقات مضافة في قائمتك

source: 8:00 AM
ar: 8:00 ص

source: 8:15 AM
ar: 8:15 ص

source: 8:30 AM
ar: 8:30 ص

source: 8:45 AM
ar: 8:45 ص

source: 9:00 AM
ar: 9:00 ص

source: 9:30 AM
ar: 9:30 ص

source: 9:45 AM
ar: 9:45 ص

source: 10:00 AM
ar: 10:00 ص

source: 10:15 AM
ar: 10:15 ص

source: 10:30 AM
ar: 10:30 ص

source: 10:45 AM
ar: 10:45 ص

source: 11:00 AM
ar: 11:00 ص

source: 11:15 AM
ar: 11:15 ص

source: 11:30 AM
ar: 11:30 ص

source: 11:45 AM
ar: 11:45 ص

source: 12:00 PM
ar: 12:00 م

source: 12:15 PM
ar: 12:15 م

source: 12:30 PM
ar: 12:30 م

source: 12:45 PM
ar: 12:45 م

source: 1:00 PM
ar: 1:00 م

source: 1:15 PM
ar: 1:15 م

source: 1:30 PM
ar: 1:30 م

source: 1:45 PM
ar: 1:45 م

source: 2:00 PM
ar: 2:00 م

source: 2:15 PM
ar: 2:15 م

source: 2:30 PM
ar: 2:30 م

source: 2:45 PM
ar: 2:45 م

source: 3:00 PM
ar: 3:00 م

source: 3:15 PM
ar: 3:15 م

source: 3:30 PM
ar: 3:30 م

source: 3:45 PM
ar: 3:45 م

source: 4:00 PM
ar: 4:00 م

source: Course Create
ar: إضافة مساق

source: Select Professor
ar: إختر الدكتور

source: Select Year
ar: إختر السنة

source: Select Semister
ar: إختر الفصل

source: Select Time
ar: إختر الوقت

source: Select Week Day
ar: إختر ايام الأسبوع

source: Say hi to
ar: قل مرحبا لـ

source: Friends
ar: الأصدقاء

source: Already Friend with
ar: صديق بالفعل مع

source: Add Friend
ar: إضافة صديق

source: Add as a friend
ar: إضافة كصديق

source: Cancel Request
ar: إلغاء طلب الصداقة

source: Cancel you friend request to
ar: إلغاء طلب الصداقة مع

source: Sent you are friend request
ar: أرسل لك طلب صداقة

source: No internet connection!
ar: لا يوجد إتصال بالإنترنت

source: Message Sent
ar: تم إرسال الرسالة

source: Please select the user to send message
ar: إختر أحد الأصدقاء لبدء المحادثة

source: There are currently no Friend in your List.
ar: لا يوجد حاليا أي اصدقاء في قائمتك

source: Get Participant
ar: ضف أعضاء

source: Login
ar: تسجيل الدخول

source: Select friend for add
ar: إختر أحد الأصدقاء للأضافة

source: React On Post
ar: تفاعل مع المنشور

source: Members
ar: الأعضاء

source: Are you sure to want to delete this ?
ar: هل انت متأكد من الحذف؟

source: Cv Info
ar: تفاصيل السيرة الذاتية

source: Objective
ar: الأهداف

source: Education
ar: الشهادات التعليمية

source: Experience
ar: الخبرات العملية

source: Skills
ar: المهارات

source: Reference
ar: التوصية

source: Crate Cv
ar: إنشاء سيرتك الذاتية

source: Detail...
ar: التفاصيل

source: Select Nationality
ar: إختر الجنسية

source: My Profile
ar: حسابي الشخصي

source: My CV
ar: سيرتي الذاتية

source: My GPA
ar: معدلي

source: Contact Details
ar: معلومات التواصل

source: My Groups
ar: مجموعاتي

source: My Notes
ar: ملخصاتي

source: My Courses
ar: مساقاتي

source: My Classifieds
ar: إعلاناتي المبوية

source: My Events
ar: فعالياتي

source: MY POST
ar: منشوراتي

source: SAVED
ar: محفوظ

source: Add Email
ar: أضف بريد إلكتروني

source: There are currently no Feeds in your wall.
ar: لا يوجد أي منشورات حاليا

source: Vote
ar: أصوات

source: Are you sure you want to Unfriend ?
ar: هل أنت متأكد من إلغاء الصداقة

source: Country List
ar: قائمة الدول

source: Done
ar: تم

source: Alert
ar: تحذير

source: Age should be greater than 18!
ar: !يجب أن يكون عمرك اكبر من 18 سنة

source: Please Enter the First Name
ar: أضف الإسم الأول

source: Please Enter the Last Name
ar: أضف الإسم الأخير

source: Phone Number must be greater than 10 character.
ar: رقم الهاتف يجب أن يكون 10 أرقام على الأقل

source: Server Error
ar: خطأ في الخادم

source: Overall CGPA
ar: المعدل التراكمي الكلي

source: Semester GPA
ar: معل الفصل

source: Please enter valid Credit Hours.
ar: الرجاء إضافة عدد ساعات صحيح

source: Please select Grade
ar: إختر المعدل

source: email can't be blank
ar: حقل البريد الإلكتروني لا يمكن ان يكون فارغا

source: GROUP
ar: مجموعة

source: There are currently no Post in your wall.
ar: لا يوجد أي منشورات حالياً

source: There are currently no file in your list.
ar: لا يوجد أي ملفات في قائمتك

source: No access.
ar: لا يمكنك الوصول

source: Professor
ar: الدكتور

source: Language
ar: اللغة

source: There are currently no Group Member in your List.
ar: لا يوجد أي أعضاء في هذه المجموعة

source: There are currently no Invite Members in your List.
ar: لا يوجد أي دعوات للإنضمام في هذه المجموعة

source: There are currently no Request List
ar: لا يوجد أي طلبات للإنضمام في هذه المجموعة

source: Please enter the email address
ar: يرجى إدخال البريد الإلكتروني

source: Please enter the valid email address
ar: يرجى إدخال البريد الإلكتروني صحيح

source: Invite User
ar: دعوة مستخدمين آخرين

source: Are you sure to reject this group invitation ?
ar: هل أنت متأكد من رفض دعوة الإنضمام

source: Are you sure to Leave this group
ar: هل أنت متأكد من مغادرة المجموعة

source: Cancel Request
ar: إلغاء طلب الإنضمام

source: Join Group
ar: الإنضمام للمجموعة

source: My Group
ar: مجموعتي

source: Leave
ar: مغادرة

source: members
ar: الأعضاء

source: Posts
ar: المنشورات

source: Sign Up
ar: تسجيل

source: Please select the friend
ar: يرجى إختيار صديق

source: There are currently no Friend Select.
ar: لا يوجد صديق محدد

source: Anonymous
ar: مخفي

source: Inbox Chat
ar: المحادثات

source: Clear Chat
ar: مسح المحادثة

source: Un Block User
ar: إلغاء الحظر

source: Block User
ar: حظر هذا المستخدم

source: Group Info
ar: تفاصيل المجموعة

source: Add Participants
ar: إضافة أعضاء

source: Delete Group
ar: حذف المجموعة

source: Leave Group
ar: مغادرة المجموعة

source: Are you sure to want to delete this Chat ?
ar: هل أنت متأكد من حذف هذه المحادثة؟

source: Are you sure to want to delete this group?
ar: هل أنت متأكد من حذف هذه المجموعة؟

source: Are you sure to want to block this User?
ar: هل أنت متأكد من حظر هذا المستخدم؟

source: Ok
ar: موافق

source: Are you sure to want to delete this message ?
ar: هل أنت متأكد من حذف هذه الرسالة؟

source: There are currently no Messages .
ar: لا يوجد أي رسائل حاليا

source: New Chat
ar: محادثة جديدة

source: New Group
ar: مجموعة جديدة

source: Select Enter message
ar: أكتب رسالة

source: Select Friends from list
ar: إختر صديق من القائمة

source: What you want to post today
ar: !بماذا ستشارك اليوم

source: Please Enter the comment
ar: أترك تعليقاً

source: Please Enter the value of option 1
ar: الرجاء إدخال قيمة الخيار 1

source: Please Enter the value of option 2
ar: الرجاء إدخال قيمة الخيار 2

source: Please Enter the value of option 3
ar: الرجاء إدخال قيمة الخيار 3

source: Please Enter the value of option 4
ar: الرجاء إدخال قيمة الخيار 4

source: Please Enter the value of option 5
ar: الرجاء إدخال قيمة الخيار 5

source: Post must be more than 5 characters!
ar: يجب كتابة 5 حروف على الأقل

source: Please select the group
ar: يرجى إختيار المجموعة

source: Reply Comment
ar: رد

source: Already Report
ar: تم الإبلاغ سابقا

source: Report
ar: إبلاغ

source: Sexual content
ar: محتوى غير لائق

source: Hateful or abusive content
ar: محتوى يحض على الكراهية

source: Spam or misleading
ar: محتوى زائف

source: Please select the option
ar: يرجى إختيار أحد الخيارات

source: Are you sure to want to delete this ?
ar: هل انت متأكد من الحذف؟

source: Are you sure to want to delete this comment ?
ar: هل انت متأكد من حذف التعليق؟

source: edited
ar: تم التعديل

source: (My Vote)
ar: (تصويتي)

source: Me
ar: أنا

source: ago
ar: مضت

source: send
ar: إرسال

source: There are currently no Feeds in this group.
ar: لا يوجد أي منشورات حاليا

source: Wall
ar: الجدار

source: Groups
ar: المجموعات

source: My Account
ar: حسابي

source: My Friends
ar: أصدقائي

source: Solutions
ar: أسئلو و أجوبة

source: Books
ar: الكتب

source: Classifieds
ar: الإعلانات المبوبة

source: Jobs
ar: الوظائف

source: Log out
ar: تسجيل الخروج

source: Log Out
ar: تسجيل الخروج

source: Authehnticate
ar: المصادقة

source: YES
ar: نعم

source: NO
ar: لا

source: Are you sure to Logout
ar: هل انت متأكد من تسجيل الخروج

source: UnreadMessage
ar: رسالة غير مقروءة

source: University List
ar: قائمة الجامعات

source: Select Country
ar: إختر البلد

source: Select University
ar: إختر الجامعة

source: Select College
ar: إختر الكلية

source: Select Campus
ar: إختر الفرع

source: Select Student Level
ar: إختر المرحلة الجامعية

source: male
ar: ذكر

source: female
ar: أنثى

source: Thank You !
ar: شكرا

source: Thank you for registering! You will receive an email confirmation shortly, please check your spam/junk folder.
ar: نشكرك لتسجيلك معنا! سيصلك بريد إلكتروني لتأكيد التسجيل بعد لحظات، يرجى تفقد ملف البريد المهمل

source: There are currently no Avatar in this Time.
ar: لا يوجد أي صور رمزية

source: Recent Classifieds
ar: أحدث الإعلانات

source: More Categories
ar: المزيد من الإعلانات

source: Note Type
ar: نوع الملخص

source: forwarded
ar: رسالة محولة

source: Join
ar: إنضمام

source: Accept
ar: قبول

source: Reject
ar: رفض

source: Name
ar: الإسم

source: University
ar: الجامعة

source: College
ar: الكلية

source: Email
ar: البريد الإلكتروني

source: Mobile
ar: رقم الهاتف

source: Joined Date
ar: تاريخ الإنضمام

source: Referal Code
ar: رمز الإحالة

source: Primary Email
ar: البريد الأساسي

source: Unfriend
ar: إلغاء الصداقة

source: Unfollow
ar: إلغاء المتابعة

source: Follow
ar: متابعة

source: Friend Request
ar: طلب صداقة

source: Privacy Settings
ar: إعدادات الخصوصية

source: Determine who can view or see your activities in the following :
ar: :قم بتحديد من يمكنه مشاهدة التالي

source: Public
ar: عام

source: Friends
ar: الأصدقاء

source: Only Me
ar: أنا فقط

source: Profile
ar: الحساب

source: Contact
ar: الإتصال

source: Phone:
ar: :رقم الهاتف

source: Email:
ar: :البريد الإلكتروني

source: Admin
ar: مدير المجموعة

source: Code :
ar: :الرمز

source: Professor :
ar: :المحاضر

source: Location :
ar: : الموقع

source: Year / Semister :
ar: :السنة / الفصل

source: Grade :
ar: :المعدل

source: Feedback :
ar: :ملاحظات

source: Year
ar: السنة

source: Semister
ar: الفصل

source: Location
ar: الموقع

source: Could'nt find your course ?
ar: لم تعثر على المساق؟

source: Choose Week Days
ar: إختر أيام الأسبوع

source: Course Name *
ar: *إسم المساق

source: Course Code *
ar: *رمز المساق

source: Credit Hour *
ar: *عدد الساعات

source: Day
ar: اليوم

source: Time
ar: الوقت

source: ADD COURSE
ar: إضافة مساق آخر

source: Want to answer student questions ?
ar: هل تريد الإجابة على أسئلة الطلبة لاحقاً؟

source: + Add Day
ar: +إضافة يوم

source: Posted On :
ar: :نُشر في

source: Expiry Date :
ar: : تاريخ الإنتهاء

source: Job Type :
ar: : نوع الوظيفة

source: Application Status :
ar: :حالة الطلب

source: Cover Letter :
ar: :رسالة طلب عمل

source: Job Details
ar: تفاصيل الوظيفة

source: Recent Jobs for this company
ar: أحدث الوظائف من هذه الشركة

source: Select Category
ar: إختر التصنيفات

source: Title
ar: العنوان

source: Category
ar: التصنيف

source: Type
ar: النوع

source: Clear
ar: مسح

source: Pick Image From
ar: إضافة صورة

source: Photo Library
ar: إختيار من الألبوم

source: Camera
ar: صورة جديدة

source: Source Type
ar: نوع المصدر

source: Take photo
ar: صورة جديدة

source: Choose photo
ar: إختيار من الألبوم

source: Please fill all the fields
ar: يرجى تكملة النموذج

source: Please give the proper phone Number
ar: يرجى كتابة رقم الهاتف بطريقة صحيحة

source: Password must be greater 5 digits
ar: كلمة المرور يجب أن تكون أكثر

source: Please enter valid Email Address
ar: يرجى إدخال بريد إلكتروني صحيح

source: Password can't be blank
ar: يرجى إدخال كلمة مرور

source: Phone Number can't be blank
ar: يرجى إدخال رقم هاتف

source: user does not exists
ar: هذا المستخدم غير مسجّل

source: Id Number can't be blank
ar: لا يمكن ترك حقل الهوية فارغاً

source: Please Select the image
ar: يرجى إختيار صورة

source: Please Enter the name
ar: يرجى إدخال الإسم

source: Full Name must be alphabet characters.
ar: الإسم الكامل يجب أن يكون صحيحا

source: Confirm Password can't be blank
ar: يرجى تأكيد كلمة المرور

source: Password mismatch
ar: كلمة المرور غير متطابقة

source: No Internet Connection
ar: لا يوجد إتصال بالإنترنت

source: Sign In
ar: تسجيل الدخول

source: Register now!
ar: سجل الآن

source: You don't have an account?
ar: ليس لديك حساب؟

source: Forget Password
ar: نسيت كلمة المرور؟

source: Login !
ar: تسجيل الدخول

source: Female
ar: أنثى

source: Send Reset Link
ar: إرسال الرابط

source: Please enter your registered email and we will send you a password reset link
ar: الرجاء إدخال البريد الإلكتروني المسجل وسيتم إرسال رابط إعادة تعيين كلمة المرور إليك

source: New Confirm Password
ar: تأكيد كلمة المرور الجديدة

source: You don't have an account ?
ar: ليس لديك حساب؟

source: Done
ar: تم

source: New Password
ar: كبمة المرور الجديدة

source: Password
ar: كلمة المرور

source: Select University
ar: إختر الجامعة

source: Last Name
ar: الإسم الأخير

source: First Name
ar: الإسم الأول

source: Male
ar: ذكر

source: Forget Password ?
ar: نسيت كلمة المرور؟

source: Already have account?
ar: لديك حساب بالفعل

source: Register Now
ar: سجل الآن

source: File
ar: ملف

source: Select the group * :
ar: :إختر المجموعة*

source: Send
ar: إرسال

source: + Post
ar: + منشور

source: Post as Anonymous?
ar: إخفاء الهوية

source: disable comment
ar: إلغاء المناقشة والتعليقات

source: Option 1
ar: خيار واحد

source: Replying to
ar: الرد على

source: Update Post Now
ar: تحديث المنشور

source: Create Group
ar: إنشاء مجموعة

source: + Group
ar: + مجموعة

source: Option 4
ar: خيار 4

source: Select Group
ar: إختر المجموعة

source: Post
ar: منشور

source: Add
ar: إضافة

source: Choose friends to start communication
ar: إختر الأصدقاء من القائمة لبدء المحادثة

source: The group description is visable to participants of the group and the people invited to the group
ar: سيكون وصف المجموعة ظاهرا للأعضاء والأشخاص المدعوين للإنضمام الى المجموعة

source: Poll
ar: إستبيان

source: Report Post
ar: إبلاغ عن المنشور

source: Option 2
ar: خيار 2

source: Edit Post
ar: تعديل المنشور

source: Member
ar: عضو

source: Option 5
ar: خيار 5

source: Option 3
ar: خيار 3

source: Post Now
ar: نشر الآن

source: Provide a group name and optional group icon
ar: أضف اسم المجموعة والأيقونة

source: Post as Anonymous
ar: إخفاء الهوية

source: Add More
ar: إضافة المزيد

source: 10 Members
ar: 10 أعضاء

source: group :
ar: : المجموعة

source: Poll
ar: إستبيان

source: Select post type :
ar: :إختر نوع المنشور

source: Message
ar: رسالة

source: Participants
ar: أعضاء

source: Next
ar: التالي

source: New Post
ar: منشور جديد

source: Save
ar: حفظ

source: Update
ar: تحديث

source: Edit CV
ar: تعديل السيرة الذاتية

source: Suggestions
ar: الإقتراحات

source: Current
ar: الحالب

source: Grades
ar: المعدل

source: Phone Number *
ar: * رقم الهاتف

source: All Friends
ar: كل الأصدقاء

source: Make sure to provide your real photo since this is your CV and it will be shows to the public
ar: إحرص على أن تكون صورتك الشخصية واضحة وصحيحة، سيتم إستخدام الصورة في كافة طلبات التوظيف

source: Save
ar: حفظ

source: Address
ar: العنوان

source: Saved
ar: حفظ

source: Calculate
ar: إحسب المعدل

source: Course
ar: المساق

source: Email*
ar: البريد الإلكتروني*

source: Language*
ar: اللغة*

source: Note : These courses related to your tasks . This will not add in University banner!
ar: ملاحظة: المساقات تضاف إلى قائمة المهام الخاصة بك ، لن يتم

source: Language *
ar: *اللغة

source: + Add
ar: + إضافة

source: Add Course
ar: إضافة مساق

source: About Me *
ar: * نبذة عني

source: Build Your CV
ar: إنشاء سيرتك الذاتية

source: Phone Number
ar: رقم الهاتف

source: Website or Portfolio Link
ar: رابط الموقع الإلكتروني أو معرض الأعمال

source: Previous
ar: السابق

source: My Course
ar: مساقاتي

source: Credits
ar: عدد الساعات

source: Total Semester CH
ar: مجموع عدد الساعات

source: follow
ar: متابعة

source: Steps away from creating CV
ar: خطوات بسيطة وستحصل على سيرة ذاتية ممتازة

source: CGPA
ar: المعدل التراكمي الكلي

source: Settings
ar: الإعدادات

source: Ready to go
ar: متابعة

source: Requests
ar: الطلبات

source: Create CV
ar: إنشاء سيرة ذاتية

source: Edit Profile
ar: تعديل الحساب الشخصي

source: Phone Number*
ar: *رقم الهاتف

source: Select Nationality*
ar: إختر الجنسية*

source: Account
ar: الحساب

source: Few Steps more
ar: خطوات إضافية بسيطة

source: +Add Course
ar: +إضافة مساق

source: Date of Birth
ar: تاريخ الولادة

source: Current GPA
ar: المعدل التراكمي الحالي

source: About Me*
ar: * نبذة عني

source: Adding primary email helps you to get all system notifications on your regular email , But you must use your university email to sign in.
ar: ستصلك كافة الإشعارات على البريد الإلكتروني الأساسي ، لتسجيل الدخول يجب إستخدام البريد الإلكتروني الجامعي

source: Confirm new password
ar: تأكيد كلمة المرور

source: Want to :
ar: :أريد أن

source: Sell
ar: بيع

source: Type Message
ar: أكتب رسالتك

source: Continue
ar: متابعة

source: Description :
ar: :الوصف

source: Scan ISBN Code
ar: ISBN إمسح رمز

source: New Book
ar: كتاب جديد

source: Add the details maunally
ar: إضافة تفاصيل الكتاب يدويا

source: Edition
ar: الإصدار

source: Add book ISBN here
ar: هنا ISBN ضف رمز

source: Course Name
ar: إسم المساق

source: Couldn't find your course in our course list ?
ar: لم تعثر على المساق؟

source: Course Code
ar: رمز المساق

source: Add Main Image :
ar: إضافة الصورة الأساسية

source: Select Book Status
ar: حدد حالة الكتاب

source: Author
ar: المؤلف

source: Add the book details by scanning the ISBN Code located in the back side of the book
ar: المتواجد في ظهر الكتاب ISBN قم بإدخال بيانات الكتاب عن طريق مسح رمز

source: Edition :
ar: : الإصدار

source: Edit Book
ar: تعديل

source: Book Type :
ar: : نوع الكتاب

source: Submit Book
ar: رفع الكتاب

source: Donate
ar: تبرع

source: Send me buyer request as email notification
ar: أبلغني عن طريق البريد الإلكتروني

source: Select City
ar: إختر المدينة

source: Images
ar: صور

source: Non Academic
ar: غير أكاديمي

source: Academic
ar: أكاديمي

source: Book Status
ar: حالة الكتاب

source: + Add
ar: + إضافة

source: My Books
ar: كتبي

source: Price
ar: السعر

source: Author :
ar: :المؤلف

source: Condition :
ar: : الحالة

source: Free Books
ar: كتب مجانية

source: Bookstore
ar: معرض الكتب
